In [1]:
import pandas as pd

data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Math': [85, 92, 78, 90, 88],
    'Science': [89, 95, 76, 91, 84]
}

df = pd.DataFrame(data)

In [3]:
sorted_df = df.sort_values(by='Math',ascending=False)

In [4]:
sorted_df

   Student  Math  Science
1      Bob    92       95
3    David    90       91
4      Eva    88       84
0    Alice    85       89
2  Charlie    78       76

In [6]:
df.sort_values(by=['Math','Science'],ascending=[False,True])

   Student  Math  Science
1      Bob    92       95
3    David    90       91
4      Eva    88       84
0    Alice    85       89
2  Charlie    78       76